In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, root_mean_squared_error

In [58]:
df = pd.read_csv('quikr_car.csv')

In [4]:
df.describe()

              name company  year          Price  kms_driven fuel_type
count          892     892   892            892         840       837
unique         525      48    61            274         258         3
top     Honda City  Maruti  2015  Ask For Price  45,000 kms    Petrol
freq            13     235   117             35          30       440

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [6]:
df.sample(5)

,name,company,year,Price,kms_driven,fuel_type
228,Mahindra Thar CRDe 4x4 AC,Mahindra,2016,"7,30,000","29,000 kms",Diesel
235,Mercedes Benz B Class B180 Sports,Mercedes,2014,"14,00,000","31,000 kms",Petrol
637,Nissan Sunny XL,Nissan,2011,"2,30,000","52,000 kms",Petrol
716,Maruti Suzuki Zen LXi BS III,Maruti,2004,"68,000","56,000 kms",Petrol
156,Maruti Suzuki Alto 800 Lxi,Maruti,2018,"3,10,000","3,000 kms",Petrol

In [17]:
df['company'].value_counts()

company
maruti        237
hyundai       145
mahindra      100
tata           79
honda          61
toyota         39
chevrolet      35
renault        34
ford           31
volkswagen     20
skoda          13
audi           11
mini            8
bmw             8
datsun          8
commercial      6
mitsubishi      6
mercedes        6
nissan          6
force           4
fiat            4
i               4
hindustan       3
used            2
urgent          2
jaguar          2
sale            2
swift           1
urjent          1
selling         1
jeep            1
yamaha          1
very            1
volvo           1
2012            1
well            1
all             1
7               1
9               1
scratch         1
land            1
sell            1
any             1
Name: count, dtype: int64

In [34]:
df['company'] = df['company'].str.lower()

In [35]:
df['company'][df['company'].values == 'any']

845    any
Name: company, dtype: object

In [59]:
df = df[~df['company'].isin(['any', 'sell', 'land','scratch', '9', '7', 'all', 'well', '2012', 'very', 'jeep', 'selling', 'urjent', 'used',])]

In [37]:
df.sample(100)

,name,company,year,Price,kms_driven,fuel_type
328,Honda Amaze,honda,2014,"2,74,999","35,000 kms",Petrol
597,Maruti Suzuki Alto K10 LXi CNG,maruti,2009,"90,000","62,000 kms",Petrol
77,Honda Amaze,honda,2015,"3,44,999","22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,hyundai,2014,"3,25,000","28,000 kms",Petrol
75,Skoda Fabia 1.2L Diesel Ambiente,skoda,2011,"1,59,500","38,200 kms",Diesel
...,...,...,...,...,...,...
790,Tata Indigo eCS,tata,2016,"1,30,000","1,50,000 kms",Diesel
725,i want sale my car.no emi....uber atta,i,d...,"3,20,000",NaN,NaN
198,Toyota Innova 2.5 G BS III 8 STR,toyota,2006,"3,65,000","73,000 kms",Diesel
358,Hyundai i10 Sportz,hyundai,2012,"2,30,000","34,000 kms",Petrol
864,Tata Indica eV2 LS,tata,2016,"50,500","91,200 kms",Diesel

In [49]:
df['year'].value_counts()

year
2015    117
2014     94
2013     94
2016     76
2012     75
       ...
ture      1
emi       1
able      1
no.       1
zest      1
Name: count, Length: 61, dtype: int64

In [50]:
df['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '...', '150k', 'TOUR', '2003', 'r 15', '2004', 'Zest', '/-Rs',
       'sale', '1995', 'ara)', '2002', 'SELL', '2001', 'tion', 'odel',
       '2 bs', 'arry', 'Eon', 'o...', 'ture', 'emi', 'car', 'able', 'no.',
       'd...', 'SALE', 'digo', 'sell', 'd Ex', 'n...', 'e...', 'D...',
       ', Ac', 'go .', 'k...', 'o c4', 'zire', 'cent', 'Sumo', 'cab',
       't xe', 'EV2', 'r...', 'zest'], dtype=object)

In [60]:
df.isna().sum()

name           0
company        0
year           0
Price          0
kms_driven    44
fuel_type     47
dtype: int64

In [61]:
df = df[df['year'].str.isnumeric()]

In [62]:
df['year'].shape

(842,)

In [63]:
df['year'].isna().sum()

0

In [80]:
df['price'].replace('Ask For Price', np.nan, inplace=True)

In [69]:
df.rename(columns={'Price':'price'}, inplace = True)

In [73]:
df['price'][df['price'].str.isnumeric()].unique()

array([], dtype=object)

In [90]:
df['price'] = df['price'].str.replace(',','').astype(float)

In [93]:
df['price']=df['price'].fillna(float(df['price'].mean()))

In [100]:
df['price'] = df['price'].astype(np.uint32)

In [111]:
df['kms_driven'].value_counts()

kms_driven
45,000 kms      30
35,000 kms      30
55,000 kms      25
50,000 kms      23
20,000 kms      22
                ..
1,03,553 kms     1
29,685 kms       1
30,874 kms       1
49,800 kms       1
1,66,000 kms     1
Name: count, Length: 258, dtype: int64

In [117]:
df['kms_driven'] = df['kms_driven'].str.split(' ').str.get(0)

In [132]:
df['kms_driven'].replace('Petrol', np.nan, inplace=True)

In [123]:
df['kms_driven'] = df['kms_driven'].str.replace(',','')

In [136]:
df['kms_driven'] = df['kms_driven'].fillna(df['kms_driven'].astype(float).mean())

In [159]:
df['kms_driven'] = df['kms_driven'].astype(np.uint32)

In [162]:
df['fuel_type'].value_counts()

fuel_type
Petrol    440
Diesel    395
LPG         2
Name: count, dtype: int64

In [185]:
df['fuel_type'][df['fuel_type'].isna()]

   index fuel_type
0     85       NaN
1    132       NaN
2    890       NaN
3    891       NaN

In [187]:
df.dropna(inplace=True)

In [189]:
df.reset_index(drop=True, inplace=True)

In [195]:
df['fuel_type'] = df['fuel_type'].str.lower()

In [198]:
df.drop(columns = 'fuel_tyoe', inplace=True)

In [199]:
df

,name,company,year,price,kms_driven,fuel_type
0,hyundai santro xing xo erlx euro iii,Hyundai,2007,80000,45000,petrol
1,mahindra jeep cl550 mdi,Mahindra,2006,425000,40,diesel
2,maruti suzuki alto 800 vxi,Maruti,2018,410960,22000,petrol
3,hyundai grand i10 magna 1.2 kappa vtvt,Hyundai,2014,325000,28000,petrol
4,ford ecosport titanium 1.5l tdci,Ford,2014,575000,36000,diesel
...,...,...,...,...,...,...
831,maruti suzuki ritz vxi abs,Maruti,2011,270000,50000,petrol
832,tata indica v2 dle bs iii,Tata,2009,110000,30000,diesel
833,toyota corolla altis,Toyota,2009,300000,132000,petrol
834,tata zest xm diesel,Tata,2018,260000,27000,diesel
835,mahindra quanto c8,Mahindra,2013,390000,40000,diesel

In [208]:
df['name'] = df['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [217]:
df.describe()

              year         price     kms_driven
count   835.000000  8.350000e+02     835.000000
mean   2012.512575  4.022356e+05   46054.899401
std       4.032633  3.769385e+05   34520.115890
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.765000e+05   25000.000000
50%    2013.000000  3.100000e+05   41000.000000
75%    2015.000000  4.899990e+05   56604.000000
max    2019.000000  3.100000e+06  400000.000000

In [212]:
df['year'] = df['year'].astype(np.uint16)

In [216]:
df = df[df['price'] < 6e6]

In [218]:
df.reset_index(inplace=True, drop=True)

In [219]:
df

                       name   company  year   price  kms_driven fuel_type
0       hyundai santro xing   Hyundai  2007   80000       45000    petrol
1       mahindra jeep cl550  Mahindra  2006  425000          40    diesel
2        maruti suzuki alto    Maruti  2018  410960       22000    petrol
3         hyundai grand i10   Hyundai  2014  325000       28000    petrol
4    ford ecosport titanium      Ford  2014  575000       36000    diesel
..                      ...       ...   ...     ...         ...       ...
830      maruti suzuki ritz    Maruti  2011  270000       50000    petrol
831          tata indica v2      Tata  2009  110000       30000    diesel
832    toyota corolla altis    Toyota  2009  300000      132000    petrol
833            tata zest xm      Tata  2018  260000       27000    diesel
834      mahindra quanto c8  Mahindra  2013  390000       40000    diesel

[835 rows x 6 columns]

In [220]:
X = df.drop(columns='price')
y = df['price']

In [223]:
from sklearn.model_selection import train_test_split

In [224]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state = 42, test_size=0.2)

In [227]:
lr = LinearRegression()

In [226]:
from sklearn.preprocessing import OneHotEncoder

In [228]:
ohe = OneHotEncoder()

In [ ]:
ohe.fit(X[['name', 'company', 'fuel_type']])